Revit 2027 API
FabricationHandlePosition Enumeration
 Position of fabrication part valve handle.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum FabricationHandlePosition
Public Enumeration FabricationHandlePosition
public enum class FabricationHandlePosition
type FabricationHandlePosition
Members
Member name | Value | Description
Closed | 0 |  Closed position.
Open | 1 |  Open position.
Swept | 2 |  Swept displaying the fully swept geometry from open to closed.
Undefined | -1 |  Undefined handle position.
See Also
Reference
Autodesk.Revit.DB.Fabrication Namespace